<a href="https://colab.research.google.com/github/vasumaha/Projects/blob/main/Analyse_London_Olympics_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:

data=pd.read_excel("/content/Olympic 2012 Medal Tally.xlsx",)

In [3]:
data.head()

   Unnamed: 0     Unnamed: 1    Unnamed: 2  ...   Unnamed: 4 Unnamed: 5 Unnamed: 6
0         NaN        Country  Country Code  ...  Medal Tally        NaN        NaN
1         NaN            NaN           NaN  ...         Gold     Silver     Bronze
2         NaN  Great Britain           GBR  ...           29         17         19
3         NaN         China            CHN  ...           38         28         22
4         NaN         Russia           RUS  ...           24         25         32

[5 rows x 7 columns]

In [4]:
data_x=data.iloc[2:,1:]

In [5]:
data_x.columns=data.iloc[0,1:]
data_x

0        Country Country Code  Year Medal Tally NaN NaN
2  Great Britain          GBR  2012          29  17  19
3         China           CHN  2012          38  28  22
4         Russia          RUS  2012          24  25  32
5  United States           US  2012          46  28  29
6          Korea          KOR  2012          13   8   7
7          Japan          JPN  2012           7  14  17
8        Germany          GER  2012          11  11  14

# **Country With Max Gold**

In [6]:
sorted=data_x.sort_values(['Medal Tally'],ascending=False)
print(sorted.iloc[0,0])

United States

# **Countries With More Than 20 Gold**

In [7]:
data_x["Medal Tally"]=data_x["Medal Tally"].astype(int)

In [8]:
data_x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 2 to 8
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country       7 non-null      object
 1   Country Code  7 non-null      object
 2   Year          7 non-null      object
 3   Medal Tally   7 non-null      int64
 4   nan           7 non-null      object
 5   nan           7 non-null      object
dtypes: int64(1), object(5)
memory usage: 468.0+ bytes

In [9]:
data_x[data_x['Medal Tally']>20]["Country"]

2    Great Britain
3           China
4           Russia
5    United States
Name: Country, dtype: object

In [10]:
data_x["Bronze"]=data_x.iloc[0:,5].astype(int)
data_x["Silver"]=data_x.iloc[0:,4].astype(int)

In [11]:
data_x

0        Country Country Code  Year  Medal Tally NaN NaN  Bronze  Silver
2  Great Britain          GBR  2012           29  17  19      19      17
3         China           CHN  2012           38  28  22      22      28
4         Russia          RUS  2012           24  25  32      32      25
5  United States           US  2012           46  28  29      29      28
6          Korea          KOR  2012           13   8   7       7       8
7          Japan          JPN  2012            7  14  17      17      14
8        Germany          GER  2012           11  11  14      14      11

In [12]:
for i in range(7):
    Name=data_x.iloc[i,0]
    Gold=data_x.iloc[i,3]
    tot=data_x.iloc[i,3]+data_x.iloc[i,6]+data_x.iloc[i,7]
    print(f"{Name} has won {Gold} Gold medals and {tot} total medal")

Great Britain has won 29 Gold medals and 65 total medal
China  has won 38 Gold medals and 88 total medal
Russia has won 24 Gold medals and 81 total medal
United States has won 46 Gold medals and 103 total medal
Korea has won 13 Gold medals and 28 total medal
Japan has won 7 Gold medals and 38 total medal
Germany has won 11 Gold medals and 36 total medal